// https://alexgyver.ru/lessons/progmem/

//const int answer_size = 26;
//  //String *answer = new String[answer_size];
//  
//  const char PROGMEM answer[answer_size][100] {
//    "КУ#","ТЕСТИМ",
//    "ТЕЙЛОР#","ПРИВЕТ",
//    "Р#","ТЕСТ",
//    "УКЕ#","ФЩШЦУРДОАПТВАДОТМВАДdgfОТИВАЫДОТИВАЛОИТВАЛОТЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААА",
//    "УКЕ#","ФЩШЦУРДОАПТВАДОТМВdgfАДОТИВАЫДОТИВАЛОИТВАЛОТЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААА",
//    "УКЕ#","ФЩШЦУРДОАПТВАДОТМgfВАДОТИВАЫДОТИВАЛОИТВАЛОТЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААА",
//    "УКЕ#","ФЩШЦУРДОАПТВАДОgdТМВАДОТИВАЫДОТИВАЛОИТВАЛОТЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААА",
//    "УКЕ#","ФЩШЦУРДОАПТВАgdfДОТМВАДОТИВАЫДОТИВАЛОИТВАЛОТЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААА",
//    "УКЕ#","ФЩШЦУРДОАПТgdfВАДОТМВАДОТИВАЫДОТИВАЛОИТВАЛОТЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААА",
//    "УКЕ#","ФЩШЦУРДОАgdffПТВАДОТeerrМВАДОТИВАЫДОТИВАЛОИТВАЛОТЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААА",
//    "УКЕ#","ФЩШЦУРДgdОАПТВАДОТМВАДОТИВАЫДОТИВАЛОИТВАЛОТЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААА",
//    "УКЕ#","ФЩШЦdgfdfУРДОАПТВАДОТМВАДОТИВАЫДОТИВАЛОИТВАЛОТЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААА",
//    "УКЕ#","ФЩfgШЦУРДОАПТВАДОТМВАДОТИВАЫДОТИВАЛОИТВАЛОТЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫЫААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААААА",
//  };

//    byte tst[1] = { 'Б' };
//    switch (tst[0]) {
//       case (byte)'Б': Serial.println("Ok!");
//    }

// https://wiki.iarduino.ru/page/encoding-arduino/

String find_answer(String request) {
  
  const int answer_size = 6;
  //String *answer = new String[answer_size];
  
  String answer[answer_size] {
    "КУ","ТЕСТИМ",
    "ТЕЙЛОР","ПРИВЕТ",
    "Р","ТЕСТ",
  };

 
  for (int i = 0; i < answer_size; i+=2) {
    bool flag = 1;
    for (int u = 0; answer[i][u]!=0; u++) { // answer[i][u]!='#'
      if (request[u]!=answer[i][u*2+1]) {
        flag = 0;
        break;
      }
    }
    if (flag) {
      return answer[i+1];
    }
  }
  return String("НЕТ");
}
